Repository: doanson44/doanson44.github.io
Catalog: Resources/Resources.*.resx
Languages: vi

source: Back to List
vi: Quay lại danh sách

source: Title
vi: Tiêu đề

source: Enter todo title
vi: Nhập tiêu đề công việc

# TitleRequired
source: Title is required
vi: Tiêu đề là bắt buộc

# TitleMaxLength
source: Title cannot exceed 100 characters
vi: Tiêu đề không được vượt quá 100 ký tự

source: Description
vi: Mô tả

# EnterDescription
source: Enter description (optional)
vi: Nhập mô tả (tùy chọn)

# DescriptionMaxLength
source: Description cannot exceed 500 characters
vi: Mô tả không được vượt quá 500 ký tự

source: Priority
vi: Ưu tiên

source: Select priority
vi: Chọn ưu tiên

# PriorityRequired
source: Priority is required
vi: Ưu tiên là bắt buộc

source: Cancel
vi: Hủy

source: Update
vi: Cập nhật

source: Create
vi: Tạo

source: Form Features
vi: Tính năng biểu mẫu

# CQRSDocumentation
source: CQRS: Form submits CreateTodoCommand or UpdateTodoCommand
vi: CQRS: Biểu mẫu gửi CreateTodoCommand hoặc UpdateTodoCommand

# ValidationDocumentation
source: Validation: DataAnnotations with Radzen validators
vi: Validation: DataAnnotations với Radzen validators

# AutoMapperDocumentation
source: AutoMapper: Command â†’ Entity mapping in handler
vi: AutoMapper: Ánh xạ Command → Entity trong handler

# CacheDocumentation
source: Cache: Cache invalidated after successful save
vi: Cache: Cache bị vô hiệu hóa sau khi lưu thành công

# ResponsiveDocumentation
source: Responsive: Touch-friendly on mobile devices
vi: Responsive: Thân thiện với cảm ứng trên thiết bị di động

source: Add New Todo
vi: Thêm công việc mới

source: Edit Todo
vi: Chỉnh sửa công việc

source: Todo not found
vi: Không tìm thấy công việc

source: Todo updated successfully
vi: Cập nhật công việc thành công

source: Todo created successfully
vi: Tạo công việc thành công

# FailedToSaveTodo
source: Failed to save todo: {0}
vi: Không thể lưu công việc: {0}

source: Loading...
vi: Đang tải...

source: Low
vi: Thấp

source: Medium
vi: Trung bình

source: High
vi: Cao

source: Dashboard
vi: Bảng điều khiển

source: Total Tasks
vi: Tổng số công việc

source: Completed
vi: Hoàn thành

source: Pending
vi: Đang chờ

source: Completion Rate
vi: Tỷ lệ hoàn thành

source: Recent Activity
vi: Hoạt động gần đây

# NoRecentActivity
source: No recent activity. Start by creating a new todo!
vi: Không có hoạt động gần đây. Hãy tạo công việc mới!

source: Quick Actions
vi: Hành động nhanh

source: View All Todos
vi: Xem tất cả công việc

source: About This App
vi: Về ứng dụng này

# Architecture
source: Architecture: CQRS Pattern
vi: Kiến trúc: CQRS Pattern

# Caching
source: Caching: In-Memory Cache (5 min TTL)
vi: Cache: In-Memory Cache (5 phút TTL)

source: just now
vi: vừa xong

# MinutesAgo
source: {0} min ago
vi: {0} phút trước

# HoursAgo
source: {0} hours ago
vi: {0} giờ trước

# DaysAgo
source: {0} days ago
vi: {0} ngày trước

source: Todo List
vi: Danh sách công việc

source: Loading todos...
vi: Đang tải công việc...

source: Status
vi: Trạng thái

source: Created
vi: Đã tạo

source: Actions
vi: Hành động

source: Mark as Complete
vi: Đánh dấu hoàn thành

source: Edit
vi: Chỉnh sửa

source: Delete
vi: Xóa

# NoTodosFound
source: No todos found. Click "Add New" to create your first todo!
vi: Không tìm thấy công việc nào. Nhấn "Thêm mới" để tạo công việc đầu tiên!

source: Success
vi: Thành công

source: Todo marked as complete
vi: Công việc đã được đánh dấu hoàn thành

source: Error
vi: Lỗi

# FailedToUpdateTodo
source: Failed to update todo: {0}
vi: Không thể cập nhật công việc: {0}

source: Confirm Delete
vi: Xác nhận xóa

# DeleteConfirmationMessage
source: Are you sure you want to delete '{0}'?
vi: Bạn có chắc chắn muốn xóa '{0}'?

source: Yes, Delete
vi: Có, Xóa

source: Deleted
vi: Đã xóa

source: Todo deleted successfully
vi: Công việc đã được xóa thành công

# FailedToDeleteTodo
source: Failed to delete todo: {0}
vi: Không thể xóa công việc: {0}

source: Add Todo
vi: Thêm công việc

source: Not Found
vi: Không tìm thấy

# ContentNotExist
source: Sorry, the content you are looking for does not exist.
vi: Xin lỗi, nội dung bạn tìm kiếm không tồn tại.
